src/cf/Documents/НакладнаяСАТУРН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НакладнаяСАТУРН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МестаХраненияПартийСАТУРН</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПартийСАТУРН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГрузоотправительОрганизацияСАТУРН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузоотправительМестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузополучательОрганизацияСАТУРН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузополучательМестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГосКонтракта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтракт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГосударственныеКонтрактыИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТранспортныеСредстваИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНакладнаяСАТУРН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящаяНакладная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоКонтейнера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоРейса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПломбы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаЭкспортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаИмпортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТранспорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТранспортныхСредствСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриториальноеУправление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТерриториальныхУправленийСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаможенныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТаможенныхПунктовСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПАТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторПАТСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокПринято</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПринято</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокВозвращено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВозвращено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмеряемойВеличиныСАТУРН</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыИзмеряемыхВеличинСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВУпаковкеСАТУРН</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоВУпаковкеСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиСАТУРН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыделеннаяПартия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСАТУРН</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПринятоСАТУРН</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВозвращеноСАТУРН</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоСАТУРН</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаРасхождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПартияВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииСАТУРН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыДокументовСАТУРН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументовСАТУРН</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиНакладнойСАТУРН</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиПланаПримененияСАТУРН</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиИмпортаПродукцииСАТУРН</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиАктаИнвентаризацииСАТУРН</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиПроизводственнойОперацииСАТУРН</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиЗапросаОстатковПартийСАТУРН</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиАктаПримененияСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие2</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюСАТУРН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыСАТУРН</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/НакладнаяСАТУРН/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнтеграцияСАТУРНПереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	ЗаполнитьОбъектПоСтатистике();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("Товары.Серия");
	НепроверяемыеРеквизиты.Добавить("ДатаПолучения");
	НепроверяемыеРеквизиты.Добавить("ДатаВозврата");
	НепроверяемыеРеквизиты.Добавить("ГрузополучательМестоХранения");
	
	ОбязательныеРеквизиты = Новый Массив;
	
	ТекущееСостояние = РегистрыСведений.СтатусыДокументовСАТУРН.ТекущееСостояние(Ссылка);
	СтатусСАТУРН = ТекущееСостояние.Статус;
	
	ГрузополучательСопоставленСОрганизацией  = Ложь;
	ГрузоотправительСопоставленСОрганизацией = Ложь;
	
	Организации = Новый Массив;
	Организации.Добавить(ГрузоотправительОрганизацияСАТУРН);
	Организации.Добавить(ГрузополучательОрганизацияСАТУРН);
	ЗначенияСопоставлений = Справочники.КлассификаторОрганизацийСАТУРН.ОрганизацииКонтрагентыПоКлассификаторамСАТУРН(
		Организации);
	
	СвязанноеЗначение = ЗначенияСопоставлений.Получить(ГрузополучательОрганизацияСАТУРН);
	Если СвязанноеЗначение <> Неопределено И ЗначениеЗаполнено(СвязанноеЗначение.Организация) Тогда
		ГрузополучательСопоставленСОрганизацией = Истина;
	КонецЕсли;
	
	СвязанноеЗначение = ЗначенияСопоставлений.Получить(ГрузоотправительОрганизацияСАТУРН);
	Если СвязанноеЗначение <> Неопределено И ЗначениеЗаполнено(СвязанноеЗначение.Организация) Тогда
		ГрузоотправительСопоставленСОрганизацией = Истина;
	КонецЕсли;
	
	Если Операция <> Перечисления.ВидыОперацийСАТУРН.НакладнаяЭкспорт Тогда
		НепроверяемыеРеквизиты.Добавить("Контрагент");
		НепроверяемыеРеквизиты.Добавить("СтранаЭкспортер");
		НепроверяемыеРеквизиты.Добавить("СтранаИмпортер");
		НепроверяемыеРеквизиты.Добавить("ТипТранспорта");
		НепроверяемыеРеквизиты.Добавить("ТерриториальноеУправление");
		НепроверяемыеРеквизиты.Добавить("ТаможенныйПункт");
		НепроверяемыеРеквизиты.Добавить("Товары.КодТНВЭД");
	КонецЕсли;
	
	Если Операция = Перечисления.ВидыОперацийСАТУРН.НакладнаяПеревозка Тогда
		Если ГрузополучательСопоставленСОрганизацией
			И УказыватьДатуПолучения(СтатусСАТУРН) Тогда
			ОбязательныеРеквизиты.Добавить("ДатаПолучения");
		КонецЕсли;
		Если ГрузоотправительСопоставленСОрганизацией
			И УказыватьДатуВозврата(СтатусСАТУРН) Тогда
			ОбязательныеРеквизиты.Добавить("ДатаВозврата");
		КонецЕсли;
		
		ТекущееСостояние = РегистрыСведений.СтатусыДокументовСАТУРН.ТекущееСостояние(Ссылка);
		СтатусСАТУРН = ТекущееСостояние.Статус;
		
		Если СтатусСАТУРН = Перечисления.СтатусыОбработкиНакладнойСАТУРН.ВПути
			Или СтатусСАТУРН = Перечисления.СтатусыОбработкиНакладнойСАТУРН.ПодтверждениеОшибка Тогда
			
			Для Каждого СтрокаТовары Из Товары Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаТовары.ПричинаРасхождения) 
					И (СтрокаТовары.КоличествоУпаковокПринято <> СтрокаТовары.КоличествоУпаковок
					   Или СтрокаТовары.КоличествоСАТУРН <> СтрокаТовары.КоличествоПринятоСАТУРН)
					Тогда
					
					ОбщегоНазначения.СообщитьПользователю(
							НСтр("ru = 'Укажите причину расхождения'"),
							ЭтотОбъект, 
							ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
								"Товары", СтрокаТовары.НомерСтроки, "ПричинаРасхождения"),,
							Отказ);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НепроверяемыеРеквизиты = ОбщегоНазначенияКлиентСервер.РазностьМассивов(НепроверяемыеРеквизиты, ОбязательныеРеквизиты);
	ИнтеграцияСАТУРНПереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияСАТУРН.ЗаписатьСоответствиеНоменклатуры(ЭтотОбъект,, "ВыделеннаяПартия");
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ИнтеграцияСАТУРН.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Идентификатор = Неопределено;
	ДатаПолучения = Дата(1, 1, 1);
	ДатаВозврата  = Дата(1, 1, 1);
	ВходящаяНакладная = Ложь;
	
	ОчищаемыеРеквизиты = Новый Структура;
	ОчищаемыеРеквизиты.Вставить("Партия",                       Неопределено);
	ОчищаемыеРеквизиты.Вставить("ВыделеннаяПартия",             Неопределено);
	ОчищаемыеРеквизиты.Вставить("ПартияВозврат",                Неопределено);
	ОчищаемыеРеквизиты.Вставить("КоличествоПринятоСАТУРН",      0);
	ОчищаемыеРеквизиты.Вставить("КоличествоВозвращеноСАТУРН",   0);
	ОчищаемыеРеквизиты.Вставить("КоличествоУпаковокПринято",    0);
	ОчищаемыеРеквизиты.Вставить("КоличествоУпаковокВозвращено", 0);
	ОчищаемыеРеквизиты.Вставить("КоличествоПринято",            0);
	ОчищаемыеРеквизиты.Вставить("КоличествоВозвращено",         0);
	ОчищаемыеРеквизиты.Вставить("ИдентификаторСтрокиСАТУРН",    0);
	ОчищаемыеРеквизиты.Вставить("КодПартии",                    "");
	ОчищаемыеРеквизиты.Вставить("ПричинаРасхождения",           "");
	
	Для Каждого СтрокаТовары Из Товары Цикл
		ЗаполнитьЗначенияСвойств(СтрокаТовары, ОчищаемыеРеквизиты);
		СтрокаТовары.КоличествоУпаковокПринято = СтрокаТовары.КоличествоУпаковок;
		СтрокаТовары.КоличествоПринято         = СтрокаТовары.Количество;
		СтрокаТовары.КоличествоПринятоСАТУРН   = СтрокаТовары.КоличествоСАТУРН;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ИнтеграцияИС.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.НакладнаяСАТУРН.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ИнтеграцияИС.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	РегистрыНакопления.ОстаткиПартийСАТУРН.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	РегистрыСведений.МестаХраненияПартийСАТУРН.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияИСПереопределяемый.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ);
	
	ИнтеграцияИС.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ИнтеграцияИСПереопределяемый.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	ИнтеграцияИС.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьОбъектПоСтатистике()
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеСАТУРН.ДанныеЗаполненияНакладнаяСАТУРН(ГрузоотправительОрганизацияСАТУРН, ГрузополучательОрганизацияСАТУРН);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеСАТУРН.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция УказыватьДатуПолучения(СтатусСАТУРН)
	
	Если СтатусСАТУРН = Перечисления.СтатусыОбработкиНакладнойСАТУРН.Черновик
		Или СтатусСАТУРН = Перечисления.СтатусыОбработкиНакладнойСАТУРН.Обрабатывается
		Или СтатусСАТУРН = Перечисления.СтатусыОбработкиНакладнойСАТУРН.Ошибка Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция УказыватьДатуВозврата(СтатусСАТУРН)
	
	Если СтатусСАТУРН = Перечисления.СтатусыОбработкиНакладнойСАТУРН.КВозврату
		Или СтатусСАТУРН = Перечисления.СтатусыОбработкиНакладнойСАТУРН.ПодтверждениеВозвратаОшибка
		Или СтатусСАТУРН = Перечисления.СтатусыОбработкиНакладнойСАТУРН.ПодтверждениеУтратыГрузаОшибка
		Или СтатусСАТУРН = Перечисления.СтатусыОбработкиНакладнойСАТУРН.ПринятЧастично Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецЕсли
